<?php

namespace Database\Seeders;

use App\Models\Region;
use Illuminate\Database\Console\Seeds\WithoutModelEvents;
use Illuminate\Database\Seeder;
use Illuminate\Support\Facades\DB;

use App\Models\Occupation;

class RegionSeeder extends Seeder
{
    private static $regions = [
        "Москва",
        "Санкт-Петербург",
        "Московская область",
        "Ленинградская область",
        "Адыгея",
        "Алтай",
        "Алтайский край",
        "Амурская область",
        "Архангельская область",
        "Астраханская область",
        "Башкортостан",
        "Белгородская область",
        "Брянская область",
        "Бурятия",
        "Владимирская область",
        "Волгоградская область",
        "Вологодская область",
        "Воронежская область",
        "Дагестан",
        "Еврейская АО",
        "Забайкальский край",
        "Ивановская область",
        "Ингушетия",
        "Иркутская область",
        "Кабардино-Балкария",
        "Калининградская область",
        "Калмыкия",
        "Калужская область",
        "Камчатский край",
        "Карачаево-Черкесия",
        "Карелия",
        "Кемеровская область",
        "Кировская область",
        "Коми",
        "Костромская область",
        "Краснодарский край",
        "Красноярский край",
        "Курганская область",
        "Курская область",
        "Липецкая область",
        "Магаданская область",
        "Марий Эл",
        "Мордовия",
        "Мурманская область",
        "Ненецкий Авт. Окр.",
        "Нижегородская область",
        "Новгородская область",
        "Новосибирская область",
        "Омская область",
        "Оренбургская область",
        "Орловская область",
        "Пензенская область",
        "Пермский край",
        "Приморский край",
        "Псковская область",
        "Ростовская область",
        "Рязанская область",
        "Самарская область",
        "Саратовская область",
        "Сахалинская область",
        "Свердловская область",
        "Северная Осетия - Алания",
        "Смоленская область",
        "Ставропольский край",
        "Тамбовская область",
        "Татарстан",
        "Тверская область",
        "Томская область",
        "Тульская область",
        "Тыва",
        "Тюменская область",
        "Удмуртия",
        "Ульяновская область",
        "Хабаровский край",
        "Хакасия",
        "Ханты-Мансийский авт. окр.",
        "Челябинская область",
        "Чечня",
        "Чувашия",
        "Чукотский авт. окр.",
        "Якутия",
        "Ямало-Ненецкий авт. окр.",
        "Ярославская область",
    ];

    public function run()
    {
        if (DB::table('regions')->count() > 0) {
            echo "\e[31m Regions were not seeded as the table is not empty";
            return Region::all();
        }

        $regions = collect(self::$regions)->map(fn($region) => ['label' => $region]);
        DB::table('regions')->insert($regions->toArray());

        return Region::all();
    }
}
